configuration/src/InformationRegisters/AccountingCheckResults/AccountingCheckResults.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingCheckResults</name>
  <resources>
    <name>IssueSummary</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>IssueSeverity</name>
    <type>
      <types>EnumRef.AccountingIssueSeverity</types>
    </type>
  </resources>
  <resources>
    <name>EmployeeResponsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>AdditionalInformation</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Detected</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>DeleteIgnoreIssue</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Checksum</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ObjectWithIssue</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CheckRule</name>
    <type>
      <types>CatalogRef.AccountingCheckRules</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CheckKind</name>
    <type>
      <types>CatalogRef.ChecksKinds</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UniqueKey</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IgnoreIssue</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/CommonModules/AccountingAuditServerCall/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region Internal

// To call from the AccountingCheckResults report command.
//
// Parameters:
//  ReportDetailsData -  DataCompositionDetailsData
//  SpreadsheetDocument - SpreadsheetDocument
//  DetailsIndex - Number
//                    - Undefined
// Returns:
//  Boolean
// 
Function IgnoreIssue(ReportDetailsData, SpreadsheetDocument, DetailsIndex) Export
	Result = SelectedCellDetails(ReportDetailsData, SpreadsheetDocument, DetailsIndex);
	If Result = Undefined Then
		Return False;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("ObjectWithIssue", Result.ObjectWithIssue);
	Query.SetParameter("CheckRule", Result.CheckRule);
	Query.SetParameter("CheckKind", Result.CheckKind);
	Query.Text = 
		"SELECT
		|	AccountingCheckResults.IgnoreIssue AS IgnoreIssue
		|FROM
		|	InformationRegister.AccountingCheckResults AS AccountingCheckResults
		|WHERE
		|	AccountingCheckResults.ObjectWithIssue = &ObjectWithIssue
		|	AND AccountingCheckResults.CheckRule = &CheckRule
		|	AND AccountingCheckResults.CheckKind = &CheckKind";
	Value = Query.Execute().Unload()[0].IgnoreIssue;
	
	AccountingAudit.IgnoreIssue(Result, Not Value);
	
	RowFound = False;
	For LineNumber = 1 To SpreadsheetDocument.TableHeight Do
		For ColumnNumber = 1 To SpreadsheetDocument.TableWidth Do
			Area = SpreadsheetDocument.Area(LineNumber, ColumnNumber, LineNumber, ColumnNumber);
			If Area.Details <> DetailsIndex Then
				Continue;
			EndIf;
			RowFound = True;
			Break;
		EndDo;
		If RowFound Then
			Break;
		EndIf;
	EndDo;
	
	If RowFound Then
		For ColumnNumber = 1 To SpreadsheetDocument.TableWidth Do
			Area = SpreadsheetDocument.Area(LineNumber, ColumnNumber, LineNumber, ColumnNumber);
			If Value Then
				LastRow = SpreadsheetDocument.TableHeight;
				TextColor = SpreadsheetDocument.Area(LastRow, 1, LastRow, 1).TextColor;
				If TextColor <> Undefined Then
					Area.TextColor = TextColor;
				EndIf;
			Else
				Area.TextColor = StyleColors.InaccessibleCellTextColor;
			EndIf;
		EndDo;
	EndIf;
	
	Return True;
EndFunction

// To call from the AccountingCheckResults report command.
//
Function DataForObjectChangeHistory(ReportDetailsData, SpreadsheetDocument, DetailsIndex) Export
	Details = SelectedCellDetails(ReportDetailsData, SpreadsheetDocument, DetailsIndex);
	If Details = Undefined Then
		Return Undefined;
	EndIf;
	
	Result = New Structure;
	Result.Insert("Ref", Details.ObjectWithIssue);
	Result.Insert("ToVersion", False);
	
	If Common.SubsystemExists("StandardSubsystems.ObjectsVersioning") Then
		ModuleObjectsVersioning = Common.CommonModule("ObjectsVersioning");
		Result.ToVersion = ModuleObjectsVersioning.ObjectVersioningEnabled(Details.FullObjectName);
	EndIf;
	
	Return Result;
EndFunction

// To call from the AccountingCheckResults report.
//
Function SelectedCellDetails(ReportDetailsData, SpreadsheetDocument, DetailsIndex) Export
	If DetailsIndex = Undefined Then
		Return Undefined;
	EndIf;
	
	Result = New Structure;
	Result.Insert("ObjectWithIssue");
	Result.Insert("CheckRule");
	Result.Insert("CheckKind");
	Result.Insert("IssueSummary");
	Result.Insert("FullObjectName");
	
	DetailsData = GetFromTempStorage(ReportDetailsData); // DataCompositionDetailsData
	Details       = DetailsData.Items[DetailsIndex].GetFields();
	Value          = Details[0].Value;
	ValueInParts   = StrSplit(Value, ";");
	
	If ValueInParts.Count() < 5 Then
		Return Undefined;
	EndIf;
	
	ObjectManager = Common.ObjectManagerByFullName(ValueInParts[0]);
	Result.ObjectWithIssue = ObjectManager.GetRef(New UUID(ValueInParts[1]));
	Result.CheckRule  = Catalogs.AccountingCheckRules.GetRef(New UUID(ValueInParts[2]));
	Result.CheckKind      = Catalogs.ChecksKinds.GetRef(New UUID(ValueInParts[3]));
	Result.IssueSummary = ValueInParts[4];
	Result.FullObjectName = ValueInParts[0];
	
	Return Result;
EndFunction

#EndRegion
